/**
 *
 *                                                          Поиск узла.
 * Поик узла с заданным ключом  - простейшая из основных операций с деревьями, поэтому начнем с нее. Как уже говорилось,
 * узлы в дереве двоичного поиска соответствуют объектам, содержащим информацию. Например, у нас есть дерево (рис tree_6)
 * и нам нужно найти элемент с ключом 57. В данном дереве, все элементы поддерева, находящиеся слева от любого узла
 * имеют ключ меньший, чем ключ самого узла. Справа - больший. Реализации поиска узла представлена в классе Tree.
 *
 * */

package ch8;

public class FindNode {
}
