/**
 *
 *                                                      Вставка узла.
 * Чтобы вставить узел - нужно сначала найти место для его вставки. Этот процесс почти эквивалентен поиску несуществующего
 * узла. Метод отслеживает узел от корня до узла, который станет родителем вставляемого. Когда родитель будет найден,
 * новый узел станет левым или правым потомком, в зависимости от того, будет ли ключ нового узла меньше или больше
 * родительского ключа. Допустим, мы хотим вставить элемент с ключом 45 в дерево. Процесс можно увидеть на рисунке tree_7.
 *
 * */

package ch8;

public class InsertNode {
}
