/**
 *
 *                                                   Абстрактные типы данных.
 * Абстрактные типы данных - это подход к описанию структуры данных, где внимание сосредоточено на том, что делает данная
 * структура, а не на том, как она это делает. Стеки и очереди как раз являются примерами абстрактных типов даннх. Мы уже
 * видели, что стеки и очереди могут быть реализованы на базе массивов.
 * Реализация стека на базе связного списка приведена на 201 странице.
 * Реализация очереди на базе связного списка приведена на 204 странице.
 *
 *
 **/

package ch_5;

public class AbstractDataStruct {
}
