/**
 *
 *                                                  Типы данных.
 * Выражение "тип данных" имеет достаточно широкий смысл. Термином "примитивный тип" в действительности обозначаются
 * сразу два понятия: элемент данных, обладающий определенными характеристиками, и набор операций, разрешенный для этих
 * данных. Например, переменные типа int в Java могут принимать целочисленные значения в диапазоне от 2^-31 до 2^31-1,
 * к которым могут применяться операции +,-,/,*
 *
 * */


package ch_5;

public class DataTypes {
}
