/**
 *
 *                                                      Немного истории и практики.
 * Одним из первых математиков, занимавшихся теорией графов, был Леонард Эйлер. Он решил т.н. задачу с "кенигсбергскими
 * мостами" - в городе Кенигсберг был остров с семью мостами(gr_4.png), требуется найти способ пересечь все семь мостов
 * таким образом, чтобы по каждому мосту пройти только один раз. Эйлер доказал, что это невозможно, представив задачу в
 * виде графа. Вершины - участки земли, а ребра - мосты.
 * Но это все теория, и математики долгое время работали с графом как с абстракцией. Но какая структура данных лучше
 * подойдет для описания графа на практике? Начнем с вершин, затем перейдем к ребрам.
 *
 * */

package ch13;

public class HistoryAndPractice {
}
