/**
 *
 *                                                   Использование рекурсии для
 *                                                      составления анаграмм.
 * Рекурсия предоставляет элегантное решение этой задачи. Анаграмма слова - это все возможные в слове перестановки букв.
 * Напрмиер, для слова cat список анаграмм будет таким: cat, cta, atc, act, tca, tac. Из примера ясно, что количество
 * вариантов равно факториалу количества букв (т.е для 3-х буквенного слова - 6, для 5-буквенного - 120) предполагая, что
 * буквы в слове не повторяются. При повторяющихся буквах количесвто возможных слов будет меньше.
 *
 * */


package ch_6;

public class Anagram {
}
